export default {
  // 商户登录
  sellerLogin: {
    title: 'เข้าสู่ระบบธุรกิจ',
    label: {
      username: 'ชื่อผู้ใช้',
      password: 'รหัสผ่าน',
      captcha: 'รหัสการตรวจสอบ'
    },
    placeholder: {
      username: 'กรุณาใส่ชื่อผู้ใช้หรือกล่องจดหมาย',
      password: 'กรุณาใส่รหัสผ่าน',
      captcha: 'กรุณาใส่รหัสการตรวจสอบ'
    },
    tips: {
      username: 'กรุณาใส่ชื่อผู้ใช้หรือกล่องจดหมาย',
      password: 'กรุณาใส่รหัสผ่าน',
      captcha: 'รหัสการตรวจสอบไม่สามารถว่างเปล่า'
    },
    actions: ['เข้าสู่ระบบเพื่อติดต่อความรัก', 'ทีมลงทะเบียน', 'ลืมรหัสผ่าน', 'ติดต่อฝ่ายบริการลูกค้า', 'เครือข่ายอย่างเป็นทางการ']
  },
  // 客服登录
  serverLogin: {
    title: 'ล็อกอิน',
    phone: "เข้าสู่ระบบโทรศัพท์มือถือ",
    phoneTips: "สแกนรหัสโทรศัพท์มือถือเข้าสู่ระบบไปยังโต๊ะทำงาน",
    placeholder: {
      seller_code: 'กรุณาใส่ชื่อพ่อค้า',
      username: 'กรุณากรอกชื่อผู้ใช้บริการลูกค้า',
      password: 'กรุณาใส่รหัสผ่าน',
      captcha: 'กรุณาป้อนรหัสการตรวจสอบด้านขวา'
    },
    tips: {
      username: 'ต้องระบุชื่อผู้ใช้',
      password: 'รหัสผ่านไม่สามารถว่างเปล่า',
      captcha: 'รหัสการตรวจสอบไม่สามารถว่างเปล่า'
    },
    login: 'ล็อกอิน',
    peopleType: ['เจ้าหน้าที่ฝ่ายบริการลูกค้า', 'ผู้ช่วย']
  },
  // 忘记密码
  forgetPassword: {
    title: 'ลืมรหัสผ่าน',
    subTitle: 'กรุณากรอกข้อมูลในกล่องจดหมายเข้าสู่ระบบและเราจะส่งอีเมล์ยืนยัน',
    placeholder: {
      email: 'กรุณาป้อนที่อยู่อีเมลที่ลงทะเบียน',
      veriCode: 'กรุณาใส่รหัสการตรวจสอบ',
      password: 'กรุณาใส่รหัสผ่านใหม่',
      repeatPassword: 'กรุณาใส่รหัสผ่านใหม่'
    },
    tips: {
      email: ['กล่องจดหมายไม่สามารถว่างเปล่า', 'ข้อผิดพลาดในรูปแบบกล่องจดหมาย'],
      veriCode: 'รหัสการตรวจสอบไม่สามารถว่างเปล่า',
      password: 'กรุณาใส่รหัสผ่านใหม่',
      repeatPassword: 'กรุณาใส่รหัสผ่านใหม่'
    },
    veriCode: ['หลังจากได้รับใหม่', 'ส่งรหัสการตรวจสอบ'],
    actions: ['วกกลับ', 'ตั้งค่ารหัสผ่านใหม่', 'ติดต่อฝ่ายบริการลูกค้า', 'กลับไปที่หน้าแรก'],
    resetResult: ['รีเซ็ตรหัสผ่านเรียบร้อยแล้ว', 'ล้มเหลวในการตั้งค่ารหัสผ่าน'],
    sendResult: ['ส่งเรียบร้อยแล้ว', 'ส่งล้มเหลว']
  },
  // 导航栏
  navbar: {
    periodOfValidity: 'อายุการใช้งาน',
    remaind: 'เหลืออยู่',
    remaind: 'ต่ออายุ',
    day: 'ท้องฟ้า',
    show: 'บอกข้อมูล',
    hide: 'ปิดกั้น',
    refresh: 'ทำให้สดชื่น',
    messageList: 'รายการข้อความ',
    fullScreen: 'จอเต็ม',
    exitFullScreen: 'ออกจากเต็มจอ',
    modifyPwd: 'เปลี่ยนรหัสผ่าน',
    buyProd: 'ซื้อสินค้า',
    howToUse: 'วิธีใช้',
    logout: 'ถอนตัว',
    zh: 'ภาษาจีนแบบง่าย',
    en: 'ภาษาอังกฤษ',
    vi: 'ภาษาเวียดนาม',
    th: 'ภาษาไทย',
    es: 'ภาษาสเปน',
    pt: 'ภาษาโปรตุเกส',
    ms: 'มาเลย์',
    nightMode: 'โหมดดึก',
    versionInfo: {
      title: 'ข้อมูลรุ่น',
      curVersion: 'รุ่นปัจจุบัน: v2.0',
      versionTitle: 'ข้อตกลงการอนุญาต',
      versionContent: `
      <div>1. อนุญาตให้ความรักที่จะได้รับการรับรองอย่างเป็นทางการและผู้ใช้มีสิทธิที่จะได้รับการปรับปรุงรหัสในภายหลัง</div>
      <div>2. ผู้รับใบอนุญาตอาจใช้ผลิตภัณฑ์ที่ได้รับอนุญาตให้ใช้แพลตฟอร์มใดๆที่สอดคล้องกับกฎหมายและระเบียบข้อบังคับของรัฐและไม่มีข้อจำกัดในชื่อโดเมนหรื</div>
      <div>3. ผู้รับใบอนุญาตควรเก็บบันทึกแหล่งที่มาและแหล่งที่มาของผลิตภัณฑ์ที่ได้รับอนุญาตถ้าใช้โปรแกรมเชิงพาณิชย์เช่น ERP และ CMS</div>
      <div>4. ผู้ได้รับอนุญาตจะต้องเคารพทรัพย์สินทางปัญญาอย่างเคร่งครัดรับประกันว่าไม่มีแหล่งที่มาของผลิตภัณฑ์ที่เป็นอันตรายไม่ขายหรือขายผลิตภัณฑ์ที่ได้รับอนุญาตโดยตรงหรืออ้างว่าเป็ มิฉะนั้นเราจะมีสิทธิที่จะกู้คืนใบอนุญาตผลิตภัณฑ์และความรับผิดชอบทางกฎหมายที่สอดคล้องกับสถานการณ์</div>
      <div>5. อนุญาตให้ติดต่อกับแหล่งที่มาอย่างเป็นทางการจ่ายผลิตภัณฑ์ไม่สนับสนุนการคืนเงิน</div>
      <div>6. มันเป็นหน้าที่ของเราที่จะให้ผู้รับใบอนุญาตที่มีผลิตภัณฑ์ดาวน์โหลดปรับปรุงและบำรุงรักษาในช่วงระยะเวลาที่ถูกต้องและผู้รับใบอนุญาตไม่สามารถเพลิดเพลิน ใบอนุญาตตลอดชีวิตไม่จำกัด</div>
      <div>7. www.aichating.com มีการตีความขั้นสุดท้าย</div>
      `,
      reserved: 'ลิขสิทธิ์'
    },
    modifyPwdForm: {
      title: 'เปลี่ยนรหัสผ่าน',
      label: {
        oldPwd: 'รหัสผ่านเก่า',
        newPwd: 'รหัสผ่านใหม่',
        repeatPwd: 'รหัสผ่านซ้ำ'
      },
      placeholder: {
        oldPwd: 'กรุณาใส่รหัสผ่านเก่า',
        newPwd: 'กรุณาใส่รหัสผ่านใหม่',
        repeatPwd: 'กรุณาใส่รหัสผ่านที่ซ้ำกัน'
      },
      tips: {
        oldPwd: 'รหัสผ่านใหม่ไม่สามารถว่างเปล่า',
        newPwd: 'รหัสผ่านเก่าไม่สามารถว่างเปล่า',
        repeatPwd: 'รหัสผ่านที่ซ้ำกันไม่สามารถว่างเปล่า',
        notSame: 'รหัสผ่านใหม่ไม่ตรงกับรหัสผ่านที่ซ้ำกัน'
      }
    }
  },
  // 主页
  dashboard: {
    total: 'จำนวนทั้งหมด',
    receptionVolume: {
      cumulative: 'ปริมาณการรับสะสม',
      today: 'รับวันนี้',
      online: 'เว็บบอร์ดออนไลน์ในปัจจุบัน',
      unConsult: 'ไม่ได้ปรึกษาผู้เข้าชม'
    },
    onlineServer: {
      title: 'รายละเอียดเว็บบอร์ด',
      name: 'สวัสดีเราชื่อ',
      group: 'กลุ่ม',
      lastLoginTime: 'เวลาเข้าสู่ระบบล่าสุด',
      status: 'สภาพ',
      serveredNumber: 'จำนวนผู้ให้บริการ',
      totalServeredNumber: 'จำนวนรวมของบริการ',
      online: 'ออนไลน์',
      offline: 'ออฟไลน์',
      invisible: 'ซ่อนเร้น'
    },
    offlineServer: {
      message: ' ไม่ว่าจะเป็นบริการลูกค้าด้านล่างบรรทัด',
      'tips': 'เตือนภัย',
      'confirm': 'ยืนยัน',
      'cancel': 'คิดทบทวนใหม่'
    },
    receptionOptions: [
      'วันต้อนรับล่าสุด',
      'เจ็ดวันต้อนรับเมื่อเร็วๆนี้',
      'รับวันล่าสุด'
    ],
    chart: {
      receptionVolume: 'ต้อนรับแขก'
    }
  },
  // 分组列表
  group: {
    groupNamePlaceholder: 'กรุณาใส่ชื่อกลุ่ม',
    table: {
      groupId: 'รหัสกลุ่ม',
      accessType: 'แบบฟอร์มการเข้าถึง',
      platform: 'พื้นปฐพี',
      groupName: 'ชื่อกลุ่ม',
      peopleNumber: 'กลุ่ม',
      isPrep: 'ก่อนการจัดกลุ่ม',
      status: 'สถานะการจัดกลุ่ม',
      createDate: 'สร้างเวลา',
      updateDate: 'ปรับปรุงเวลา',
      yes: 'ใช่แล้ว',
      no: 'เลว',
      active: 'กระตุ้น',
      unActive: 'เปิดใช้งาน'
    },
    form: {
      addTitle: 'เพิ่มกลุ่ม',
      editTitle: 'แก้ไขกลุ่ม',
      yes: 'ใช่แล้ว',
      no: 'เลว',
      label: {
        platform: 'แพลตฟอร์มที่เป็นเจ้าของ',
        groupName: 'ชื่อกลุ่ม',
        isActive: 'เปิดใช้งาน',
        isPrep: 'คือกลุ่มหน้า'
      },
      placeholder: {
        groupName: 'กรุณาใส่ชื่อกลุ่ม',
        platform: 'เลือกแพลตฟอร์มที่คุณเป็นเจ้าของ'
      },
      tips: {
        groupName: 'ชื่อกลุ่มไม่สามารถว่างเปล่า',
        platform: 'แพลตฟอร์มที่เป็นเจ้าของไม่สามารถว่างเปล่า'
      }
    },
    delete: {
      message: ' ลบกลุ่ม: {groupName}',
      tips: 'ทูลเกล้าฯถวาย',
      confirm: 'ยืนยัน',
      cancel: 'ยกเลิก'
    }
  },
  // 客服列表
  server: {
    search: {
      placeholder: {
        serverName: 'กรุณาใส่ชื่อลูกค้า',
        serverGroup: 'เลือกกลุ่มบริการลูกค้า'
      }
    },
    table: {
      serverCode: 'โลโก้เว็บบอร์ด',
      userName: 'สวัสดีเราชื่อ',
      serverName: 'ชื่อเว็บบอร์ด',
      serverAvatar: 'เว็บบอร์ด',
      serverGroup: 'การจัดกลุ่ม',
      maxServedNumber: 'จำนวนสูงสุดของบริการ',
      serverStatus: 'สถานะการบริการลูกค้า',
      onlineStatus: 'สถานะออนไลน์',
      activated: 'กระตุ้น',
      prohibited: 'ห้าม',
      online: 'ออนไลน์',
      offline: 'ออฟไลน์',
      invisible: 'ซ่อนเร้น',
      assist: 'ผู้ช่วย'
    },
    form: {
      addTitle: 'เพิ่มเว็บบอร์ด',
      editTitle: 'แก้ไขเว็บบอร์ด',
      yes: 'ใช่แล้ว',
      no: 'เลว',
      change: 'เปลี่ยนใหม่',
      peopleType: ['เพิ่มเว็บบอร์ด', 'เพิ่มพนักงานช่วย'],
      label: {
        serverName: 'ชื่อเว็บบอร์ด',
        serverPwd: 'รหัสผ่านเว็บบอร์ด',
        serverGroup: 'การจัดกลุ่ม',
        maxServedNumber: 'จำนวนสูงสุดของบริการ',
        userName: 'สวัสดีเราชื่อ',
        activeStatus: 'เปิดใช้งาน',
        serverAvatar: 'เว็บบอร์ด'
      },
      placeholder: {
        serverName: 'กรุณาใส่ชื่อลูกค้า',
        serverPwd: 'กรุณาใส่รหัสผ่านลูกค้า',
        resetPwd: 'ข้อมูลจะถูกตั้งค่าใหม่',
        serverGroup: 'เลือกกลุ่มที่คุณเป็นสมาชิก',
        maxServedNumber: 'กรุณาระบุจำนวนสูงสุดของบริการ',
        minServerNumber: 'จำนวนสูงสุดของบริการเป็นอย่างน้อย 10',
        userName: 'กรุณาใส่ชื่อผู้ใช้'
      },
      tips: {
        serverName: 'ชื่อลูกค้าไม่สามารถว่างเปล่า',
        serverPwd: 'รหัสผ่านลูกค้าไม่สามารถว่างเปล่า',
        serverGroup: 'กลุ่มที่เป็นสมาชิกไม่สามารถว่างเปล่า',
        maxServedNumber: 'จำนวนสูงสุดของบริการไม่สามารถว่างได้',
        userName: [
          'ชื่อผู้ใช้ไม่สามารถว่างได้',
          'ชื่อผู้ใช้นี้มีอยู่แล้ว'
        ]
      },
      assistLabel: {
        userName: 'สวัสดีเราชื่อ',
        nickName: 'ชื่อเล่น',
        password: 'รหัสผ่าน',
        isActive: 'เปิดใช้งาน',
        avatar: 'พระพักตร์'
      },
      assistPlaceholder: {
        userName: 'กรุณาใส่ชื่อผู้ใช้',
        nickName: 'กรุณาใส่ชื่อเล่น',
        password: 'กรุณาใส่รหัสผ่าน',
        isActive: 'เปิดใช้งาน',
        avatar: 'พระพักตร์',
        inputPwd: 'กรุณาใส่รหัสผ่าน',
        resetPwd: 'ป้อนข้อมูลและตั้งค่าใหม่'
      },
      assistTips: {
        userName: 'ชื่อผู้ใช้ไม่สามารถว่างได้',
        nickName: 'ชื่อเล่นไม่สามารถว่างเปล่า',
        password: 'รหัสผ่านไม่สามารถว่างเปล่า'
      },
      custom: 'ธรรมเนียมปฏิบัติ'
    },
    delete: {
      message: ' ลบลูกค้า: {serverName}',
      tips: 'ทูลเกล้าฯถวาย',
      confirm: 'ยืนยัน',
      cancel: 'ยกเลิก'
    }
  },
  // 域名绑定
  platform: {
    platformPlaceholder: 'กรุณาใส่ชื่อแพลตฟอร์ม',
    addDomainCourse: 'เพิ่มโดเมน',
    batchTips: 'เลือกแพลตฟอร์มที่คุณต้องการแก้ไขก่อน',
    table: {
      id: 'หมายเลข',
      domain: 'โดเมน',
      platform: 'ชื่อแพลตฟอร์ม',
      sign: 'ลายเซ็นเว็บบอร์ด'
    },
    form: {
      addTitle: 'เพิ่มชื่อโดเมน',
      editTitle: 'แก้ไขชื่อโดเมน',
      batchEdit: 'แก้ไขชุด',
      label: {
        platformName: 'ชื่อแพลตฟอร์ม',
        domainName: 'โดเมน',
        islayer: 'ไม่ว่าจะเป็นชั้นระเบิด',
        withdraw: 'เวลาถอน',
        serverSign: 'ลายเซ็นเว็บบอร์ด',
        skype: 'SKYPE',
        themeColor: 'สีชุดตกแต่ง',
        bgColor: 'สีพื้นหลัง',
        fontColor: 'สีตัวอักษร',
        onlineImg: 'ไอคอนเว็บบอร์ดออนไลน์',
        chatBg: 'แผนภูมิพื้นหลังแชท',
        promoteImg: 'กล่องโต้ตอบส่งเสริมกราฟ',
        picSize: 'ขนาดรูปภาพ: 260*230',
        promoteLink: 'เชื่อมโยงโปรโมชั่น'
      },
      placeholder: {
        platformName: 'กรุณาใส่ชื่อแพลตฟอร์ม',
        withdraw: 'กรุณาเลือกเวลาการถอนเงิน',
        domainName: 'กรุณาป้อนชื่อโดเมนหลายบรรทัดตัดชื่อโดเมนสามารถกรอกข้อมูลในคุณสมบัติส่วนใหญ่ใช้อ้างอิงงาน',
        serverSign: 'กรุณาใส่ลายเซ็นลูกค้า',
        skype: 'โปรดเข้ามา SKYPE',
        promoteLink: 'โปรดระบุการเชื่อมโยงโปรโมชั่น'
      },
      tips: {
        platformName: 'ชื่อแพลตฟอร์มไม่สามารถว่างเปล่า',
        domainName: 'ชื่อโดเมนไม่สามารถว่างเปล่า'
      },
      unit: {
        close: 'ปิดกล้อง',
        s: 'วินาที',
        m: 'นาที'
      },
      yes: 'ใช่แล้ว',
      no: 'เลว'
    },
    delete: {
      message: ' ลบชื่อโดเมน: {domainName}',
      tips: 'ทูลเกล้าฯถวาย',
      confirm: 'ยืนยัน',
      cancel: 'ยกเลิก'
    }
  },
  // 接入客服
  connectServer: {
    type: {
      auto: 'การเข้าถึงแบบอัตโนมัติ',
      fixed: 'การเข้าถึงการเชื่อมต่อคงที่',
      halfFixed: 'การเชื่อมต่อกึ่งถาวร',
      layer: 'การเข้าถึงชั้นระเบิด'
    },
    auto: {
      text: [
        'คุณสามารถเลือกเงื่อนไขที่สร้างการเชื่อมโยงไปยัง URL',
        'ป้อนหรือเลือกแพลตฟอร์มที่เหมาะสม',
        'เลือกพารามิเตอร์ที่กำหนดเอง',
        'เลือกพารามิเตอร์ที่แนะนำ',
        'สร้างการเชื่อมโยงลูกค้า',
        '* เหมาะสำหรับการเข้าถึงบริการลูกค้าหลายในเวลาเดียวกันการจัดสรรบริการลูกค้าตามนโยบายการจัดสรร',
        'ไม่เลือกกลุ่มหรือกลุ่มบริการลูกค้าทั้งหมด',
        'สร้างรหัส QR'
      ],
      placeholder: {
        platform: 'ป้อนหรือเลือกแพลตฟอร์มที่เหมาะสม',
        group: 'เลือกกลุ่ม'
      },
      tips: {
        platform: 'โปรดระบุหรือเลือกแพลตฟอร์มที่เหมาะสม'
      },
      table: {
        strategy: {
          title: 'กฎการจัดสรร',
          options: ['การจัดสรรแพลตฟอร์ม', 'การจัดสรรภายในกลุ่ม']
        },
        link: 'การเชื่อมโยงการเข้าถึง',
        ercode: 'คิวอาร์โค้ด'
      },
      log: 'เมื่อตรวจสอบ: ผู้เยี่ยมชมสามารถดูประวัติการสนทนากับเจ้าหน้าที่ได้',
      domain: 'ชื่อโดเมนอื่น: แทนที่เมื่อลิงก์ถูกบล็อกตามภูมิภาค',
      logText: 'ประวัติการแชทของผู้เยี่ยมชม'
    },
    fixed: {
      text: [
        'คุณสามารถเลือกเงื่อนไขที่สร้างการเชื่อมโยงไปยัง URL:',
        'สอนการเข้าถึง',
        'ป้อนหรือเลือกแพลตฟอร์มที่เหมาะสม',
        'เลือกที่จะได้รับการบริการลูกค้าลูกค้าในกลุ่มอื่นๆ',
        'เลือกพารามิเตอร์ที่กำหนดเอง',
        'สร้างการเชื่อมโยงลูกค้า',
        'งานอัตโนมัติ',
        'แก้ไขหนึ่งหลักรับบริการลูกค้าบริการลูกค้าบริการอื่นๆในกลุ่มเป็นสำรองบริการลูกค้าบริการหลักครับโดยการสนับสนุนการบริการลูกค้า'
      ],
      placeholder: {
        platform: 'เลือกแพลตฟอร์ม',
        group: 'เลือกกลุ่ม',
        server: 'เลือกรับบริการลูกค้า'
      },
      tips: {
        platform: 'กรุณาเลือกแพลตฟอร์ม',
        group: 'เลือกกลุ่ม'
      },
      table: {
        name: 'เว็บบอร์ด',
        link: 'เชื่อมโยง'
      },
      course: {
        title: 'สอนการเข้าถึง',
        content: [
          'คุณสามารถทำตามขั้นตอนต่อไปนี้เพื่อสร้างการเชื่อมโยงที่คุณต้องการ',
          'แก้ไขการเชื่อมโยงการเข้าถึงกวดวิชา',
          '1.ในชื่อโดเมนผูกพันหน้าคลิกเพิ่มและป้อนชื่อโดเมนทั้งหมดภายใต้แพลตฟอร์มของคุณ',
          '2.เปิดวิธีการเข้าถึงหน้าเว็บและเลือกชื่อโดเมนที่มีผลผูกพันก่อนที่จะเลือกชื่อโดเมนที่ป้อนกล่อง',
          '3.ภายใต้การเลือกกลุ่มใส่กล่องเลือกกลุ่มที่คุณตั้งค่าก่อนหน้านี้ ถ้าคุณเลือกกลุ่มเท่านั้นที่จะไม่เลือกการบริการลูกค้าเพื่อสร้างการเชื่อมโยงโดยตรงคุณจะแสดงการเชื่อมโยงการบริการลูกค้าทั้งหมดในรายการ',
          '4.เลือกการบริการลูกค้าในกลุ่ม การเชื่อมโยงการเข้าถึงสำหรับการบริการลูกค้านี้จะถูกสร้างขึ้นแยกต่างหาก',
          '5.เลือกการบริการลูกค้าในกลุ่ม การเชื่อมโยงการเข้าถึงสำหรับการบริการลูกค้านี้จะถูกสร้างขึ้นแยกต่างหาก เมื่อคุณเสร็จสิ้นการเลือกชื่อโดเมนการจัดกลุ่มและการบริการลูกค้าคลิกสร้างการเชื่อมโยงการบริการลูกค้ารายการจะแสดงการเชื่อมโยงการบริการลูกค้าสำหรับเงื่อนไขที่เลือก',
          '6.คัดลอกลิงค์นี้เพื่อให้คุณสามารถเพิ่มไปยังเว็บไซต์ของคุณแพลตฟอร์มภายใต้รูปภาพใดๆหรือข้อความคลิกถ้าหน้าต่างต่อไปนี้จะปรากฏขึ้น บ่งชี้ว่าการเข้าถึงของคุณเสร็จสมบูรณ์'
        ]
      }
    },
    halfFixed: {
      text: [
        'คุณสามารถเลือกเงื่อนไขที่สร้างการเชื่อมโยงไปยัง URL:',
        'สอนการเข้าถึง',
        'ป้อนหรือเลือกแพลตฟอร์มที่เหมาะสม',
        'เลือกกลุ่มบริการลูกค้าที่ระบุ',
        'เลือกพารามิเตอร์ที่กำหนดเอง',
        'สร้างการเชื่อมโยงลูกค้า',
        'งานอัตโนมัติ',
        ' * เหมาะสำหรับหลายหรือแต่ละลูกค้าเชื่อมต่อลูกค้า'
      ],
      placeholder: {
        platform: 'เลือกแพลตฟอร์ม',
        group: 'เลือกกลุ่ม',
        server: 'เลือกเว็บบอร์ด'
      },
      tips: {
        platform: 'กรุณาเลือกแพลตฟอร์ม',
        group: 'เลือกกลุ่ม'
      },
      table: {
        name: 'เว็บบอร์ด',
        link: 'เชื่อมโยง'
      },
      course: {
        title: 'สอนการเข้าถึง',
        content: [
          'คุณสามารถทำตามขั้นตอนต่อไปนี้เพื่อสร้างการเชื่อมโยงที่คุณต้องการ',
          'แก้ไขการเชื่อมโยงการเข้าถึงกวดวิชา',
          '1.ในชื่อโดเมนผูกพันหน้าคลิกเพิ่มและป้อนชื่อโดเมนทั้งหมดภายใต้แพลตฟอร์มของคุณ',
          '2.เปิดวิธีการเข้าถึงหน้าเว็บและเลือกชื่อโดเมนที่มีผลผูกพันก่อนที่จะเลือกชื่อโดเมนที่ป้อนกล่อง',
          '3.ภายใต้การเลือกกลุ่มใส่กล่องเลือกกลุ่มที่คุณตั้งค่าก่อนหน้านี้ ถ้าคุณเลือกกลุ่มเท่านั้นที่จะไม่เลือกการบริการลูกค้าเพื่อสร้างการเชื่อมโยงโดยตรงคุณจะแสดงการเชื่อมโยงการบริการลูกค้าทั้งหมดในรายการ',
          '4.เลือกการบริการลูกค้าในกลุ่ม การเชื่อมโยงการเข้าถึงสำหรับการบริการลูกค้านี้จะถูกสร้างขึ้นแยกต่างหาก',
          '5.เลือกการบริการลูกค้าในกลุ่ม การเชื่อมโยงการเข้าถึงสำหรับการบริการลูกค้านี้จะถูกสร้างขึ้นแยกต่างหาก เมื่อคุณเสร็จสิ้นการเลือกชื่อโดเมนการจัดกลุ่มและการบริการลูกค้าคลิกสร้างการเชื่อมโยงการบริการลูกค้ารายการจะแสดงการเชื่อมโยงการบริการลูกค้าสำหรับเงื่อนไขที่เลือก',
          '6.คัดลอกลิงค์นี้เพื่อให้คุณสามารถเพิ่มไปยังเว็บไซต์ของคุณแพลตฟอร์มภายใต้รูปภาพใดๆหรือข้อความคลิกถ้าหน้าต่างต่อไปนี้จะปรากฏขึ้น บ่งชี้ว่าการเข้าถึงของคุณเสร็จสมบูรณ์'
        ]
      }
    },
    layer: {
      text: [
        'สอนการเข้าถึง',
        'เพิ่มรหัสต่อไปนี้ไปยังเว็บไซต์ที่คุณต้องการเข้าถึง:',
        'คัดลอกโค้ด',
        'คัดลอกรหัสนี้ไปยังเว็บไซต์ของคุณจะแสดงไอคอนสำหรับการบริการลูกค้าที่ปรึกษาบนเว็บไซต์ของคุณ',
        '* คุณสามารถสร้างไอคอนการบริการลูกค้าโดยอัตโนมัติหรือแทนที่ด้วยไอคอนที่กำหนดเอง'
      ],
      course: {
        title: 'หน้าต่างการเข้าถึงกวดวิชา',
        content: [
          'คุณสามารถทำตามขั้นตอนต่อไปนี้เพื่อสร้างการเชื่อมโยงที่คุณต้องการ',
          'หน้าต่างการเข้าถึงกวดวิชา',
          'กรุณาคัดลอกรหัสการเข้าถึงชั้นกระสุนก่อน',
          'จากนั้นคุณสามารถค้นหาโฟลเดอร์ที่คุณบันทึกไฟล์เว็บไซต์ของคุณค้นหา index.html ไฟล์ในไดเรกทอรีรากคลิกขวาที่เครื่องเดียวค้นหาวิธีการเปิดในเมนูแบบเลื่อนลงใช้ข้อความเพื่อเปิดแฟ้ม index.html',
          'เมื่อคุณเปิดมันด้วยข้อความที่คุณจะเห็นรหัสของเว็บไซต์ของคุณค้นหาร่างกายแท็กและวางโค้ดที่คุณคัดลอกในร่างกายแท็ก',
          'วางโค้ดที่คุณคัดลอกไว้ด้านล่าง',
          'คลิกเพื่อบันทึกไฟล์ HTML ดับเบิลคลิกที่ index.html ถ้าคุณเห็นไอคอนต่อไปนี้ปรากฏบนเว็บไซต์ของคุณแล้วคุณจะพบว่าการเข้าถึงลูกค้าที่ประสบความสำเร็จ',
          'ข้อมูลรูปแบบเช่นสีโดยอัตโนมัติจะได้รับรูปแบบที่คุณตั้งค่าในชื่อโดเมนผูกพัน'
        ]
      }
    }
  },
  // 自定义参数
  customParams: {
    placeholder: 'กรุณาใส่ชื่อพารามิเตอร์',
    text: [
      'ต่อไปนี้คือการตั้งค่าพารามิเตอร์ที่คุณสามารถเรียกโดยตรง'
    ],
    table: {
      id: 'หมายเลข',
      paramsName: 'ชื่อพารามิเตอร์',
      paramsField: 'เขตข้อมูลพารามิเตอร์'
    },
    form: {
      addTitle: 'เพิ่มพารามิเตอร์ที่กำหนดเอง',
      editTitle: 'แก้ไขพารามิเตอร์ที่กำหนดเอง',
      label: {
        name: 'ชื่อพารามิเตอร์',
        field: 'เขตข้อมูลพารามิเตอร์'
      },
      placeholder: {
        name: 'กรุณาใส่ชื่อพารามิเตอร์',
        field: 'โปรดระบุเขตข้อมูลพารามิเตอร์'
      },
      tips: {
        name: 'ชื่อพารามิเตอร์ไม่สามารถว่างเปล่า',
        field: 'เขตข้อมูลพารามิเตอร์ไม่สามารถว่างเปล่า'
      }
    },
    delete: {
      message: ' ลบพารามิเตอร์: {paramsName}',
      tips: 'ทูลเกล้าฯถวาย',
      confirm: 'ยืนยัน',
      cancel: 'ยกเลิก'
    }
  },
  // 会话分配
  sessionAssign: {
    head: 'การจัดสรรพื้นฐาน',
    isoff: 'ผู้เข้าชมเก่าและการบริการลูกค้า',
    loading: 'แจกจ่ายใน',
    options: [
      {
        title: 'การจัดเรียง',
        content: 'ตั้งค่าการจัดอันดับบริการลูกค้าการสนทนาใหม่จะถูกจัดเรียงตามลําดับที่จัดสรรให้กับลูกค้าที่เริ่มต้นด้วยการจัดเรียงที่ใกล้ที่สุ'
      },
      {
        title: 'จัดลำดับความสำคัญ',
        content: 'ตั้งค่าการจัดอันดับการบริการลูกค้าให้ความสำคัญกับการจัดอันดับลูกค้าก่อนการจัดสรรจำนวนสูงสุดของกล่องโต้ตอบจะถูกจัดสรรให้กับลูกค้'
      },
      {
        title: 'จัดสรรตามโหลดปัจจุบัน',
        content: 'เมื่อมีการสนทนาใหม่เข้ามาให้ความสำคัญกับการบริการลูกค้าที่มีจำนวนน้อยที่สุดของการสนทนาปัจจุบัน'
      },
      {
        title: 'งานเสริม',
        content: 'เมื่อกล่องโต้ตอบใหม่เข้ามาดูจำนวนของการสนทนาทั้งหมดที่สามารถจัดสรรให้กับลูกค้าในช่วงชั่วโมงสี่สิบที่ผ่านมาให้ความสำคัญกับการบริการลูกค้าน้อยที่สุด'
      },
      {
        title: 'การสุ่ม',
        content: 'เมื่อมีการสนทนาใหม่เข้ามาทั้งหมดสุ่มมอบหมายให้บริการลูกค้าที่จัดสรรในปัจจุบัน'
      }
    ]
  },
  // 会话记录
  sessionRecord: {
    customerFilter: {
      label: {
        platformName: 'ชื่อแพลตฟอร์ม',
        customerName: 'ชื่อลูกค้า',
        serverName: 'ชื่อเว็บบอร์ด',
        serviceTime: 'เวลารับ',
        customTime: 'เวลากำหนดเอง',
        talkType: 'ประเภทของการสนทนา',
        content: "เนื้อหาการสนทนา",
        satisfaction: 'ความพึงพอใจ'
      },
      placeholder: {
        platformName: 'เลือกแพลตฟอร์ม',
        customerName: 'ป้อนชื่อลูกค้าที่คุณต้องการสอบถาม',
        serverName: 'ตัวเลือกการบริการลูกค้า',
        serviceTime: 'เวลารับ',
        customTime: {
          start: 'วันที่เริ่มต้น',
          separator: 'ไปถึง',
          end: 'วันที่สิ้นสุด'
        },
        talkType: 'เลือกประเภทของการสนทนา',
        content: "กรุณาป้อนกล่องโต้ตอบ",
        satisfaction: 'เลือกความพึงพอใจ'
      },
      timeOptions: ['เจ็ดท้องฟ้า', 'สามท้องฟ้า'],
      talkTypeOptions: ['จำนวนทั้งหมด', 'เว็บบอร์ด', 'บทสนทนาที่ไม่มีข้อความ', 'การสนทนาอัตโนมัติ', 'กลุ่มสนทนา'],
      tips: {
        platformName: 'กรุณาเลือกแพลตฟอร์ม',
        customerName: 'กรุณาเลือกบริการลูกค้า',
        serviceTime: 'กรุณาเลือกเวลาแผนกต้อนรับ'
      },
      getCustomer: 'รับผู้เข้าชม'
    },
    customerList: {
      head: ['รายชื่อลูกค้า', 'ส่งออกทั้งหมด']
    },
    chatContent: {
      server: 'เว็บบอร์ด',
      read: 'แปล',
      unRead: 'ยังไม่ได้อ่าน',
      placeholder: 'กรุณาระบุการสนทนา',
      export: 'ส่งออก',
      seeCustomerDetail: 'ดูรายละเอียดลูกค้า'
    },
    customerDetail: {
      id: 'หมายเลขเซสชัน',
      userName: 'สวัสดีเราชื่อ',
      server: 'รับบริการลูกค้า',
      area: 'แว่นแคว้น',
      userIp: 'User ip',
      phone: 'โทรศัพท์',
      email: 'ไปรษณียภัณฑ์',
      enterTime: 'เวลาเข้าชม',
      duration: 'ความยาวของเซสชัน',
      source: 'แหล่งที่มาของการสนทนา',
      satisfaction: 'ความพึงพอใจ',
      browser: 'เบราว์เซอร์',
      system: 'ระบบ'
    },
    satisfactionOptions: ['ไม่พอใจมาก', 'ไม่พอใจ', 'ทั่วไป', 'ความพึงพอใจ', 'พอใจมาก'],
    noRecord: 'บันทึกเพิ่มเติม',
    noData: 'ไม่มีข้อมูล',
    noMore: 'ไม่อีกแล้ว'
  },
  // 消息列表
  messageList: {
    unreadCount: 'จำนวนที่ยังไม่ได้อ่าน: ',
    placeholder: 'เลือกแพลตฟอร์ม',
    table: {
      name: 'แหล่งข่าว',
      nameValue: '【ข่าวระบบ】',
      phoneValue: 'ไม่มี',
      phone: 'เบอร์ติดต่อ',
      content: 'เนื้อหาข้อความ',
      leaveTime: 'เวลาฝากข้อความ',
      status: 'สถานะการอ่าน',
      processTime: 'เวลาการประมวลผล',
      read: 'แปล',
      unRead: 'ยังไม่ได้อ่าน'
    },
    delete: {
      message: ' คุณต้องการลบข้อความนี้',
      tips: 'ทูลเกล้าฯถวาย',
      confirm: 'ยืนยัน',
      cancel: 'ยกเลิก'
    }
  },
  // 自动消息
  authMessage: {
    head: ['เลือกชื่อแพลตฟอร์ม', 'การตั้งค่าข้อความอัตโนมัติ'],
    config: {
      promote: {
        title: 'ข่าวโปรโมชั่น',
        tips: 'โดยอัตโนมัติส่งชุดของข้อความส่งเสริมการขายให้กับลูกค้าเมื่อกล่องโต้ตอบเปิด',
        add: 'ข่าวโปรโมชั่นใหม่',
        limit: 'ถึงห้า',
        table: {
          order: 'เลขลำดับ',
          content: 'เนื้อหา',
          status: 'สภาพ'
        },
        form: {
          addTitle: 'เพิ่มข่าวโปรโมชั่น',
          editTitle: 'แก้ไขข้อความโปรโมชั่น',
          label: {
            status: 'เปิดใช้งานฟังก์ชัน'
          },
          tips: {
            content: 'โปรโมชั่นข้อความไม่สามารถว่างเปล่า'
          }
        },
        delete: {
          message: ' คุณแน่ใจว่าต้องการลบโปรโมชั่นนี้',
          tips: 'ทูลเกล้าฯถวาย',
          confirm: 'ยืนยัน',
          cancel: 'ยกเลิก'
        }
      },
      welcomeMsg: {
        title: 'ข่าวต้อนรับ',
        tips: 'ระบบโดยอัตโนมัติส่งข้อความต้อนรับไปยังลูกค้าเมื่อแต่ละกล่องโต้ตอบเปิด',
        placeholder: 'สวัสดีค่ะมีอะไรให้ช่วยคะ'
      },
      noResponse: {
        title: 'ลูกค้าไม่ตอบสนองต่อข้อความ',
        tips: 'ระบบจะส่งข้อความไปยังลูกค้าโดยอัตโนมัติเมื่อลูกค้าไม่ตอบสนองต่อข้อความ',
        placeholder: 'สวัสดีครับการสนทนาของคุณหมดเวลาแล้วถ้าคุณมีคำถามเพิ่มเติมโปรดติดต่อเราได้ตลอดเวลา',
        text: ['เวลาส่งลูกค้าเกิน', 'ไม่ตอบสนองโดยอัตโนมัติส่งหลังจากวินาที']
      },
      offline: {
        title: 'บริการลูกค้าแบบออฟไลน์',
        tips: 'เมื่อลูกค้าครับระบบจะส่งข้อความไปยังเขาโดยอัตโนมัติ',
        placeholder: 'สวัสดีครับการบริการลูกค้าของคุณกำลังพักผ่อนกรุณาติดต่อทีหลัง'
      },
      comment: {
        title: 'ข่าวการประเมินผลการบริการลูกค้า',
        tips: 'การสนทนาสิ้นสุดการประเมินระบบจะส่งข้อความการประเมินให้กับลูกค้า',
        placeholder: 'สวัสดีครับการสนทนาของคุณเสร็จแล้วกรุณาให้คะแนนสำหรับบริการนี้'
      },
      endMsg: {
        title: 'สิ้นสุดการสนทนาข้อความ',
        tips: 'สิ้นสุดการสนทนาจะส่งข้อความไปยังลูกค้า',
        placeholder: 'สวัสดีครับการสนทนาของคุณเสร็จแล้วและหวังว่าจะให้บริการคุณอีกครั้ง'
      },
      autoMsg: {
        title: 'ป๊อปอัพข้อความอัตโนมัติสำหรับลูกค้า',
        tips: 'เมื่อคุณใช้บริการลูกค้าชั้นขีปนาวุธคุณสามารถตั้งค่าเวลาสำหรับข้อความอัตโนมัติป๊อปอัพ',
        placeholder: 'สวัสดีค่ะมีอะไรให้ช่วยคะ',
        text: ['เรียกดู', 'วินาทีข้อความลูกค้าป๊อปอัพ']
      },
      enable: 'เปิดใช้งานฟังก์ชัน',
      cancel: 'ยกเลิก',
      submit: 'ส่งทันที'
    }
  },
  // 质检评分
  qualityScore: {
    switch: 'เปิดตัวชี้วัดคุณภาพ',
    table: {
      search: ['เลือกแพลตฟอร์ม', 'วิจิน', 'กรุณาเลือกดัชนีคุณภาพ', 'ผู้บริหาร'],
      options: ['เลขลำดับ', 'ชื่อ QC', 'แพลตฟอร์มที่สอดคล้องกัน', 'จำนวนลูกค้า', 'เว็บบอร์ด', 'คะแนน']
    },
    setting: {
      title: 'ตั้งค่าดัชนีคุณภาพ',
      last: 'บทบาท',
      form: ['ชื่อ QC', 'กรุณาใส่ชื่อ QC', 'ตั้งค่าคะแนนรวม', 'กรุณาเลือกคะแนนรวม', 'วงจรตรวจสอบคุณภาพ', 'กรุณาเลือกวงจรตรวจสอบคุณภาพ', 'เวลาเข้าสู่ระบบ', 'ลูกค้าไม่ได้เข้าสู่ระบบในเวลา', 'ถ้อยคำ', 'คำหลักที่ปรากฏ', 'เพิ่มคำหลัก', 'ดัชนีการประเมิน', 'คะแนนต่ำกว่า', 'การฉกฉวย', 'ดัชนีการพูด', 'ทำซ้ำทุกครั้งที่หัวเข็มขัด', 'ตัวอย่างคะแนน', 'เริ่มการตรวจสอบจุด', 'ช่วงเวลาระหว่างการสนทนา', 'ช่วงการสนทนาเกิน', 'วินาที', 'การตอบสนองกล่องโต้ตอบ', 'ตอบเกิน'],
      table: ['เวลาสุ่มล่าสุด', 'จุดตรวจสอบการบริการลูกค้า', 'ตัวอย่างคะแนน', 'ข้อคิดเห็น', 'การดำเนินการ', 'ตัดต่อ', 'ไม่มีจุดตรวจสอบข้อมูล'],
      button: ['ทำซ้ำ', 'ทูลเกล้าฯถวาย', 'ตั้งค่าตารางเวลาการบริการลูกค้า', 'ดูตารางเวลา'],
      label: ['ทุกวัน', 'หนึ่งสัปดาห์', 'หนึ่งเดือน', 'หนึ่งในสี่']
    }
  },
  // 质检报表
  qualityTable: {
    search: ['เลือกแพลตฟอร์ม', 'เลือกเว็บบอร์ด', 'วันที่เริ่มต้น', 'จนกระทั่ง', 'วันที่สิ้นสุด', 'รายงานการส่งออก'],
    table: ['เว็บบอร์ด', 'ระยะเวลาตัวอย่าง', 'ล็อกอิน', 'ไม่ตอบ', 'หมดเวลาตอบ', 'ติ๊กถูก', 'การประเมินผล', 'คำหลัก', 'จำนวนรวม']
  },
  // 客服报表
  serverTable: {
    search: ['กรุณาเลือกเวลา', 'จนกระทั่ง', 'เลือกแพลตฟอร์ม', 'เลือกกลุ่ม', 'เลือกเว็บบอร์ด'],
    table: ['เลขลำดับ', 'เว็บบอร์ด', 'กลุ่มก้อน', 'เวลารับเฉลี่ย', 'เวลาต้อนรับทั้งหมด', 'จำนวนผู้เข้าชม', 'เฉลี่ยต่อวัน', 'เวลาตอบสนองเฉลี่ย', 'การประเมินผล', 'คะแนนคุณภาพเฉลี่ย', 'จำนวนแพลตฟอร์มบริการ', 'ชื่อแพลตฟอร์ม']
  },
  // 常用语列表
  dailyWord: {
    filter: {
      label: [
        "เลือกแพลตฟอร์ม",
        "เลือกหมวดหมู่"
      ],
      placeholder: [
        "จำนวนทั้งหมด",
        "ค้นหาวลีทั่วไป"
      ]
    },
    table: {
      id: 'โลโก้ปัญหา',
      title: 'ชื่อเรื่องย่อ',
      word: 'เนื้อหา',
      domain_title: 'แพลตฟอร์มที่เป็นเจ้าของ',
      type: 'การจัดหมวดหมู่',
      createTime: 'สร้างเวลา',
      updateTime: 'ปรับปรุงเวลา'
    },
    form: {
      addTitle: 'เพิ่มคำทั่วไป',
      editTitle: 'แก้ไขวลีทั่วไป',
      label: {
        type: 'เลือกหมวดหมู่',
        title: 'ชื่อเรื่องย่อ',
        content: 'เนื้อหาคำถาม'
      },
      placeholder: {
        type: 'โปรดเลือก',
        title: 'กรุณาป้อนชื่อ',
        content: 'โปรดระบุคำถาม'
      },
      tips: {
        type: 'หมวดหมู่ไม่สามารถว่างเปล่า',
        title: 'ชื่อเรื่องย่อไม่สามารถว่างเปล่า',
        content: 'คำถามที่ไม่สามารถว่างเปล่า'
      }
    },
    delete: {
      message: ' คุณแน่ใจว่าต้องการลบรายการนี้',
      tips: 'ทูลเกล้าฯถวาย',
      confirm: 'ยืนยัน',
      cancel: 'ยกเลิก'
    }
  },
  // 常用语分类
  dailyWordType: {
    placeholder: 'กรุณาใส่ชื่อหมวดหมู่',
    table: {
      id: 'โลโก้หมวดหมู่',
      platform: '平台名称',
      name: 'ชื่อหมวดหมู่',
      status: 'สภาพ',
      active: 'เปิดใช้',
      unActive: 'ปิดการใช้งาน'
    },
    form: {
      addTitle: 'เพิ่มหมวดหมู่',
      editTitle: 'แก้ไขหมวดหมู่',
      label: {
        platform: 'แพลตฟอร์มที่เป็นเจ้าของ',
        name: 'ชื่อหมวดหมู่',
        status: 'เปิดใช้งาน'
      },
      placeholder: {
        platform: 'แพลตฟอร์มที่เป็นเจ้าของ',
        name: 'กรุณาใส่ชื่อหมวดหมู่'
      },
      tips: {
        platform: 'แพลตฟอร์มไม่สามารถว่างเปล่า',
        name: 'ชื่อหมวดหมู่ไม่สามารถว่างเปล่า'
      },
      yes: 'ใช่แล้ว',
      no: 'เลว'
    },
    delete: {
      message: ' คุณแน่ใจว่าต้องการลบรายการนี้',
      tips: 'ทูลเกล้าฯถวาย',
      confirm: 'ยืนยัน',
      cancel: 'ยกเลิก'
    }
  },
  // 常见问题
  questions: {
    placeholder: 'จำนวนทั้งหมด',
    delTips: 'กรุณาเลือกคำถามที่คุณต้องการลบก่อน',
    table: {
      id: 'โลโก้ปัญหา',
      platform: 'ชื่อแพลตฟอร์ม',
      question: 'ปัญหา',
      answer: 'ตอบ',
      createTime: 'สร้างเวลา'
    },
    form: {
      addTitle: 'เพิ่มคำถาม',
      editTitle: 'แก้ไขปัญหา',
      label: {
        platform: 'แพลตฟอร์มที่เป็นเจ้าของ',
        question: 'ปัญหา',
        answer: 'ตอบ'
      },
      placeholder: {
        platform: 'กรุณาเลือกแพลตฟอร์ม',
        question: 'โปรดระบุปัญหา'
      },
      tips: {
        platform: 'แพลตฟอร์มที่เป็นเจ้าของไม่สามารถว่างเปล่า',
        question: 'ปัญหาไม่สามารถว่างเปล่า',
        answer: 'คำตอบไม่สามารถว่างเปล่า'
      }
    },
    delete: {
      message: ' คุณแน่ใจว่าต้องการลบรายการนี้',
      tips: 'ทูลเกล้าฯถวาย',
      confirm: 'ยืนยัน',
      cancel: 'ยกเลิก'
    }
  },
  // 机器人设置
  robot: {
    head: ['เลือกชื่อแพลตฟอร์ม', 'การตั้งค่าหุ่นยนต์'],
    config: {
      robotAble: {
        title: 'สวิตช์หุ่นยนต์',
        tips: 'เปิดใช้งานลูกค้าหุ่นยนต์'
      },
      robotFirstAble: {
        title: 'ให้บริการลูกค้าหุ่นยนต์ก่อนการบริการลูกค้า',
        tips: 'หุ่นยนต์รับลูกค้าก่อนการสนทนา'
      },
      robotLastAble: {
        title: 'รับบริการลูกค้าแบบออฟไลน์หรือที่นั่งเต็ม',
        tips: 'การสนทนาทั้งหมดจะได้รับการต้อนรับด้วยตนเองเมื่อได้รับการบริการลูกค้าถึงขีดจำกัดของการสนทนาใหม่จะได้รับโดยหุ่นยนต์'
      },
      knowledge: {
        placeholder: 'ปัญหาการค้นหา',
        entry: 'รายการที่เหลือของหุ่นยนต์',
        import: 'นำเข้าฐานความรู้',
        export: 'ส่งออกฐานความรู้',
        table: {
          question: 'ปัญหา',
          answer: 'ตอบ',
          status: 'สภาพ',
          enable: 'เปิดใช้',
          disable: 'ปิดการใช้งาน'
        },
        uploadForm: {
          title: 'เพิ่มฐานความรู้เป็นกลุ่ม',
          editTitle: 'แก้ไขฐานความรู้',
          addTitle: 'เพิ่มฐานความรู้',
          text: ['คลิกที่อัพโหลด', 'นำเข้าเอกสารที่สนับสนุนรูปแบบสำหรับ']
        },
        editForm: {
          addTitle: 'เพิ่มฐานความรู้',
          editTitle: 'แก้ไขฐานความรู้',
          label: {
            question: 'ปัญหา',
            answer: 'ตอบ',
            status: 'เปิดใช้งาน'
          },
          placeholder: {
            question: 'โปรดระบุปัญหา',
            answer: 'กรุณาใส่คำตอบ'
          },
          tips: {
            question: 'ปัญหาไม่สามารถว่างเปล่า',
            answer: 'คำตอบไม่สามารถว่างเปล่า'
          }
        },
        delete: {
          message: ' ลบรายการนี้',
          tips: 'ทูลเกล้าฯถวาย',
          confirm: 'ยืนยัน',
          cancel: 'ยกเลิก'
        }
      },
      robotName: {
        title: 'ชื่อหุ่นยนต์',
        tips: 'ให้บริการลูกค้าสมาร์ทของคุณชื่อ',
        placeholder: 'บริการลูกค้าสมาร์ท'
      },
      robotAvatar: {
        title: 'หุ่นยนต์',
        tips: 'อัพโหลดรูปของลูกค้าสมาร์ทของคุณ',
        text: ['หัวแบบกำหนดเอง', 'อัพโหลดใหม่']
      },
      robotWelMsg: {
        title: 'หุ่นยนต์ต้อนรับ',
        tips: 'หุ่นยนต์โดยอัตโนมัติส่งข้อความต้อนรับไปยังลูกค้าเมื่อลูกค้าไม่สามารถรับสายได้',
        placeholder: 'บริการลูกค้าอัจฉริยะสำหรับคุณ'
      },
      robotUnknownMsg: {
        title: 'คำตอบของคำถามที่ไม่รู้จัก',
        tips: 'เมื่อหุ่นยนต์ไม่สามารถระบุปัญหา',
        placeholder: 'ผมไม่ค่อยเข้าใจปัญหาของคุณแต่ฉันกำลังทำงานอย่างหนัก'
      },
      robotEndMsg: {
        title: 'หุ่นยนต์จบภาษา',
        placeholder: 'บริการลูกค้าสมาร์ทขอบคุณสำหรับการใช้งานของคุณ ไว้เจอกันคราวหน้านะ'
      },
      enable: 'เปิดใช้งานฟังก์ชัน',
      cancel: 'ยกเลิก',
      submit: 'ส่งทันที'
    }
  },
  // 未知问题
  unknownQuestion: {
    placeholder: 'กรุณาเลือกแพลตฟอร์ม',
    table: {
      question: 'ปัญหา',
      questioner: 'ตั้งคำถาม',
      questionTime: 'เวลาถาม',
      status: 'สภาพ',
      answered: 'ตอบ',
      unAnswer: 'ไม่ตอบ'
    },
    form: {
      addTitle: 'เพิ่มฐานความรู้',
      batchEdit: 'แก้ไขชุด',
      label: {
        question: 'ปัญหา',
        date: 'ช่วงความถูกต้องของปัญหา',
        answer: 'ตอบ',
        status: 'เปิดใช้งาน'
      },
      placeholder: {
        question: 'โปรดระบุปัญหา',
        answer: 'กรุณาใส่คำตอบ'
      },
      tips: {
        question: 'ปัญหาไม่สามารถว่างเปล่า',
        answer: 'คำตอบไม่สามารถว่างเปล่า'
      }
    },
    delete: {
      message: [' คุณแน่ใจว่าต้องการลบคำถามนี้', ' คุณแน่ใจว่าต้องการลบคำถามที่เลือก'],
      tips: 'ทูลเกล้าฯถวาย',
      confirm: 'ยืนยัน',
      cancel: 'ยกเลิก'
    },
    tips: ['กรุณาเลือกคำถามที่คุณต้องการลบก่อน', 'กรุณาเลือกคำถามที่คุณต้องการคำตอบ']
  },
  // 黑名单管理
  blackList: {
    placeholder: ['กรุณาเลือกแพลตฟอร์ม', 'โปรดระบุ IP'],
    table: {
      id: 'id',
      ip: 'ip',
      customerName: 'ชื่อผู้เข้าชม',
      realName: 'ชื่อผู้เข้าชม',
      addTime: 'เพิ่มเวลา'
    },
    delete: {
      message: ' คุณแน่ใจว่าคุณต้องการที่จะเรียกคืนผู้เข้าชม',
      tips: 'ทูลเกล้าฯถวาย',
      confirm: 'ยืนยัน',
      cancel: 'ยกเลิก'
    }
  },
  // 客服评价统计
  serverEvaluate: {
    placeholder: ['กรุณาเลือกแพลตฟอร์ม', 'เวลาเริ่มต้น', 'เวลาสิ้นสุด'],
    table: {
      serverName: 'ชื่อเว็บบอร์ด',
      star1: 'ไม่พอใจมาก',
      star2: 'ไม่พอใจ',
      star3: 'ทั่วไป',
      star4: 'ความพึงพอใจ',
      star5: 'พอใจมาก',
      percent: 'ความพึงพอใจ'
    }
  },
  // 总体评价统计
  overallEvaluate: {
    placeholder: ['กรุณาเลือกแพลตฟอร์ม', 'เวลาเริ่มต้น', 'เวลาสิ้นสุด'],
    table: {
      question: 'ปัญหาคุณภาพบริการ',
      number: 'การประเมินผล',
      percent: 'ความพึงพอใจ'
    }
  },
  // 接待统计
  visitorRecord: {
    placeholder: ['กรุณาเลือกแพลตฟอร์ม', 'เวลารับ', 'IP ผู้เข้าชม', 'กรุณาเลือกพนักงานต้อนรับ', 'เลือกวัน'],
    table: {
      visitorName: 'ชื่อผู้มาเยือน',
      visitorIp: 'IP ผู้เข้าชม',
      area: 'แว่นแคว้น',
      startTime: 'เริ่มเวลารับ',
      endTime: 'เวลารับสิ้นสุด',
      serviceTime: 'ชั่วโมงต้อนรับยาว',
      server: 'บริการลูกค้าแผนกต้อนรับ',
      total: 'จำนวนพนักงานต้อนรับทั้งหมด',
      customer: 'รับแขก'
    }
  },
  // 访客地域统计
  visitorRegion: {
    all: 'จำนวนทั้งหมด',
    orderOptions: ['การเรียงลำดับจากต่ำไปสูง', 'เรียงลำดับจากสูงไปต่ำ'],
    text: ['แผนที่ภูมิภาค', 'แพลตฟอร์มที่เกี่ยวข้อง', 'การกระจายของพื้นที่ผู้เข้าชม', 'วกกลับ'],
    table: {
      province: 'มาจากจังหวัด',
      number: 'จำนวนผู้เข้าชม'
    },
    chart: ['การกระจายทางภูมิศาสตร์ของผู้เข้าชม', 'โด่ง', 'หดหู่ใจ']
  },
  // 左侧导航栏
  router: {
    ewm: 'สแกนรหัสโทรศัพท์มือถือเข้าสู่ระบบไปยังโต๊ะทำงาน',
    dashboard: 'หน้าหลัก',
    serverWorkbench: 'เวิร์กสเตชัน',
    groupList: 'รายชื่อกลุ่ม',
    serverList: 'รายชื่อเว็บบอร์ด',
    platformList: 'โดเมนผูกพัน',
    connectServer: 'บริการลูกค้า',
    customParams: 'พารามิเตอร์ที่กำหนดเอง',
    talkManage: 'การจัดการเซสชัน',
    talkAssign: 'งานเซสชัน',
    talkRecord: 'บันทึกเซสชัน',
    messageList: 'รายการข้อความ',
    autoReplay: 'ข้อความอัตโนมัติ',
    dailyWord: 'การจัดการภาษา',
    dailyWordList: 'รายชื่อภาษาทั่วไป',
    dailyWordType: 'หมวด',
    questions: 'คำถามที่พบบ่อย',
    robotServer: 'เว็บบอร์ดหุ่นยนต์',
    robotConfig: 'การตั้งค่าหุ่นยนต์',
    unknownQuestion: 'ปัญหาที่ไม่รู้จัก',
    blackList: 'การจัดการบัญชีดำ',
    dataStatistics: 'สถิติข้อมูล',
    serverEvaluation: 'สถิติการประเมินผลการบริการลูกค้า',
    overallEvaluation: 'สถิติการประเมินผลโดยรวม',
    visitorRecord: 'สถิติแผนกต้อนรับ',
    visitorRegion: 'สถิติภูมิภาคสำหรับผู้เข้าชม',
    qualityTest: 'การตรวจสอบคุณภาพ',
    qualityScore: 'คะแนนการตรวจสอบคุณภาพ',
    qualityTable: 'รายงานการตรวจสอบคุณภาพ',
    serverTable: 'รายงานการบริการลูกค้า'
  },
  // 客服端
  chatServer: {
    'title': 'โต๊ะบริการลูกค้า',
    'flashTitle': {
      'souce': 'โต๊ะบริการลูกค้า',
      'empty': 'เอ่อ',
      'entity': 'ได้รับข้อความใหม่'
    },
    'online': 'ออนไลน์',
    'offline': 'ออฟไลน์',
    invisible: 'ซ่อนเร้น',
    invisibleAlert: {
      message: 'ยังคงมีผู้เข้าชมออนไลน์<br>โปรดลองอีกครั้งหลังจากโอนหรือลบเซสชัน'
    },
    'sessionOptions': [
      'เซสชันปัจจุบัน',
      'การสนทนาประวัติศาสตร์',
      'เซสชันรอ'
    ],
    'screenshot': [
      'เพียงแค่วางภาพลงในกล่องข้อมูล',
      'วิธีการส่งหน้าจอ'
    ],
    'curSesActions': [
      'โอนย้าย',
      'ลบเซสชันปัจจุบัน',
      'ตั้งค่า',
      'เชิญกลุ่มสนทนา',
      'ทำความสะอาดเซสชันที่สิ้นสุดทั้งหมด'
    ],
    'closeSession': {
      'message': ' คุณแน่ใจว่าต้องการลบ{customer}',
      'tips': 'เตือนภัย',
      'confirm': 'ยืนยัน',
      'cancel': 'คิดทบทวนใหม่',
      'end': 'การสนทนาจบแล้ว',
      'select': 'กรุณาเลือกผู้เข้าชมที่คุณต้องการปิดก่อน',
      'offline': 'เซสชันปัจจุบันออฟไลน์อยู่ และไม่สามารถโอนผู้เข้าร่วมได้ในขณะนี้',
    },
    'hisSesActions': [
      'รับแขก',
      'กรุณาเลือกผู้เข้าชมที่ต้องการรับ'
    ],
    'curSesDialog': {
      'title': 'การตั้งค่าเซสชัน',
      'options': [
        'สร้างการจัดเรียงเวลาสนทนา',
        'ข้อความใหม่สำหรับผู้เข้าชม',
        'การสนทนาจบลงด้วยการเก็บรักษา',
        'การสนทนาจบลงด้วยการลบ'
      ],
      'showAll': 'แสดงผู้เข้าชมทั้งหมด',
      'footer': [
        'ทำความสะอาดเซสชันสิ้นสุด',
        'ยืนยันการเปลี่ยนแปลง'
      ],
      'tips': [
        'ทำความสะอาดเรียบร้อยแล้ว',
        'ตั้งค่าเรียบร้อยแล้ว'
      ]
    },
    inviteDialog: {
      title: 'เชิญเข้าร่วมเซสชัน',
      btns: ['เชื้อเชิญ', 'เชิญ', 'ยกเลิก']
    },
    receiveInvite: ['เว็บบอร์ด', 'ขอเชิญคุณเข้าร่วมเซสชัน', 'ยอมรับ', 'ปฏิเสธ'],
    'header': [
      'ติดต่อฝ่ายบริการลูกค้า',
      'ถอนตัว',
      'โหมดดึก',
      'เสียงทิป',
      'ภาษา',
      'ทางออกที่ปลอดภัย'
    ],
    'chatContent': {
      'loading': 'กำลังโหลด',
      'noMore': 'ไม่อีกแล้ว',
      'read': 'แปล',
      'unread': 'ยังไม่ได้อ่าน',
      'revoke': 'ถอนคำพูด',
      'hasLeft': 'ลูกค้าไปแล้ว',
      'history': 'การสนทนาประวัติศาสตร์',
      'failed': 'ส่งล้มเหลว',
      'reSend': 'ส่งใหม่'
    },
    'inputMenu': {
      'placeholder': 'โปรดระบุเนื้อหา',
      'send': 'ส่ง',
      'soundDialog': {
        'title': 'บันทึกเทป',
        'tips': 'กรุณาพูดในเทป',
        'send': 'ส่ง',
        'cancel': 'ยกเลิก'
      },
      'soundNoPerm': 'ไม่ได้รับอนุญาตให้เปิดไมโครโฟน',
      customEmoji: {
        notify: {
          title: 'ทูลเกล้าฯถวาย',
          message: 'ถึงเพดานแล้วกรุณาลบภาพต่อไป'
        }
      },
      clear: 'ทำความสะอาดการสนทนา',
    },
    'userInfo': {
      'title': 'ข้อมูล',
      'visit': {
        'title': 'ข้อมูล',
        'source': 'แหล่งที่มา',
        'link': 'การเชื่อมโยงการเข้าถึง',
        'ip': 'ไอพี',
        'addr': 'พื้นที่',
        'device': 'อุปกรณ์',
        'system': 'ระบบ',
        'chip': "ความสมดุลของชิป",
        'usdt': "ดุล USDT",
        'ctime': "เวลาลงทะเบียน"
      },
      'card': {
        'title': 'นามบัตร',
        'name': 'ชื่อ：',
        customerName: 'ชื่อผู้ใช้：',
        'email': 'กล่องจดหมาย',
        'phone': 'โทรศัพท์มือถือ',
        address: '地址：',
        age: '年龄：',
        comment: '备注：',
        gender: '性别:',
        qq: 'QQ：',
        weibo: '微博：',
        weixin: '微信：',
        isming: '是否实名：',
        'placeholder': 'คลิกเพื่อป้อน'
      },
      'mark': {
        'title': 'ข้อคิดเห็น',
        'placeholder': 'โปรดระบุเนื้อหา'
      },
      'other': {
        'title': 'ดำเนินงาน',
        'addBlack': {
          'title': 'เข้าร่วมรายการสีดำ',
          'message': ' ให้แน่ใจว่าได้เพิ่มผู้เข้าชมไปยังบัญชีดำ',
          'tips': 'ทูลเกล้าฯถวาย',
          'confirm': 'ยืนยัน',
          'cancel': 'ยกเลิก',
          'text': [
            'กรุณาเลือกผู้เข้าชม',
            'การสนทนาจบแล้ว'
          ]
        }
      },
      'update': {
        'success': 'บันทึกความสำเร็จ',
        'fail': 'บันทึกความล้มเหลว'
      }
    },
    'commonWords': {
      'title': 'วลีทั่วไป',
      'send': 'ส่ง'
    },
    customSetLabel: 'ติดตั้ง',
    customizeWords: {
      title: 'ปรับแต่งวลีทั่วไป',
      button: ['เพิ่มคำตอบ', 'เพิ่มหมวดหมู่', 'เพิ่มคำตอบ', 'เสร็จสิ้น']
    },
    editHello: {
      entry: 'ต้อนรับ',
      title: 'เพิ่ม ยินดีต้อนรับ',
      button: ['เปิดใช้งาน', 'เสร็จสิ้น'],
      placeholder: 'เข้ามายินดีต้อนรับ',
    },
    'transfer': {
      'title': 'Transfer',
      'actions': 'โอนย้าย',
      'noServer': 'ไม่มีบริการลูกค้าออนไลน์',
      'select': 'กรุณาเลือกผู้ที่คุณต้องการโอน'
    },
    beOffline: 'คุณได้รับการลงโดยผู้ดูแลระบบ',
    invite: {
      notify: ['ประสบความสำเร็จ', 'เพิ่มกลุ่ม', 'คุณได้เข้าร่วมกลุ่ม']
    }
  },
  // 客户端
  chatClient: {
    'server': 'เว็บบอร์ด',
    'closeWindow': 'ปิดหน้าต่างปัจจุบัน',
    'tooltip': [
      'ข้อความ',
      'ปลายแหลม',
      'สีหน้า',
      'อัพโหลด',
      'กระแสเสียง',
      'ขีดถูก',
      'โทรศัพท์'
    ],
    'close': "ปิดกล้อง",
    'loading': 'กำลังโหลดบริการลูกค้า...',
    'chatBody': {
      'uploading': 'อัพโหลด',
      'question': 'คำถามที่พบบ่อย'
    },
    'chatContent': {
      'loading': 'กำลังโหลด',
      'noMore': 'ไม่อีกแล้ว',
      'server': [
        'หรือโอน',
        'การบริการลูกค้าเทียม',
        'บริการลูกค้าออกไปชั่วคราวได้โปรด',
        'ข้อความ',
        'ขอร้อง',
        'โอนสมาร์ทบริการลูกค้า',
        'หรือ'
      ],
      'customer': {
        'read': 'แปล',
        'unread': 'ยังไม่ได้อ่าน'
      },
      'serverHello': 'สวัสดีค่ะ คุณได้เข้าถึงลูกค้ากรุณาเริ่มการสนทนา',
      'robotUnknown': 'ผมไม่ค่อยเข้าใจปัญหาของคุณแต่ฉันกำลังทำงานอย่างหนัก',
      'transfer': 'คุณได้รับการถ่ายโอนไปยัง'
    },
    'inputMenu': {
      'placeholder': 'โปรดระบุเนื้อหา',
      'send': 'ส่ง',
      'soundDialog': {
        'title': 'บันทึกเทป',
        'tips': 'กรุณาพูดในเทป',
        'actions': [
          'ส่ง',
          'ยกเลิก'
        ]
      },
      'praseDialog': {
        'tips': 'กรุณาให้คะแนนสำหรับบริการนี้',
        'options': [
          'ไม่พอใจมาก',
          'ไม่พอใจ',
          'ทั่วไป',
          'ความพึงพอใจ',
          'พอใจมาก'
        ],
        'actions': [
          'ส่ง',
          'ยกเลิก'
        ]
      },
      'soundNoPerm': 'ไม่ได้รับอนุญาตให้เปิดไมโครโฟน',
      'prased': 'ประเมินค่า'
    },
    'leaveMsg': {
      'title': 'ข้อความ',
      'label': {
        'name': 'ติดต่อ',
        'phone': 'รายละเอียดการติดต่อ',
        'content': 'ข้อความ'
      },
      'placeholder': {
        'name': 'โปรดระบุรายชื่อผู้ติดต่อ',
        'phone': 'กรุณาระบุข้อมูลที่ติดต่อ',
        'content': 'โปรดระบุเนื้อหา'
      },
      'tips': {
        'name': 'ติดต่อไม่สามารถว่างเปล่า',
        'phone': [
          'กรุณาใส่หมายเลขโทรศัพท์ที่ถูกต้อง',
          'หมายเลขโทรศัพท์มือถือไม่สามารถว่างได้'
        ],
        'content': 'ข้อความที่ไม่สามารถปล่อยว่างได้'
      }
    },
    timeout: {
      message: 'เครือข่ายไม่ว่างโปรดลองใหม่อีกครั้งหลังจากรีเฟรช',
      confirm: 'ตกลง'
    }
  },
  action: {
    label: 'การดำเนินการ',
    type: {
      login: 'ล็อกอิน',
      offline: 'ขนอ่อน',
      save: 'เก็บรักษา',
      reset: 'ตั้งค่าใหม่',
      continue: 'คงอยู่',
      confirm: 'ยืนยัน',
      cancel: 'ยกเลิก',
      search: 'ค้นหา',
      submit: 'ทูลเกล้าฯถวาย',
      add: 'แถมท้าย',
      copy: 'ทำสำเนา',
      edit: 'ตัดต่อ',
      delete: 'ลบทิ้ง',
      invoke: 'เพรียกหา',
      answer: 'ตอบ',
      recovery: 'เริ่มใหม่',
      batchEdit: 'ปรับเปลี่ยนชุด',
      batchDelete: 'ลบชุด',
      batchAnswer: 'ชุดโซลูชั่น',
      deleteAnswerQuestion: 'ลบคําถามที่ได้รับการแก้ไข',
      markRead: 'ทำเครื่องหมายเป็นอ่าน',
      markAllRead: 'เครื่องหมายทั้งหมดเป็นอ่าน'
    }
  },
  notify: {
    fail: 'เสียเหลี่ยม',
    success: 'ประสบความสำเร็จ',
    copySuccess: 'คัดลอกสำเร็จ'
  },
  table: {
    loading: 'สอบถามรายละเอียดเพิ่มเติม...'
  },
  contextmenu: {
    refresh: 'ทำให้สดชื่น',
    close: 'ปิดกล้อง',
    closeAll: 'ปิดคนอื่น',
    closeOthers: 'ปิดทั้งหมด',
    closeTranslate: 'ปิดการแปล',
  },
  google: {
    title: 'ตรวจสอบกูเกิล',
    label: 'กรุณาใส่รหัสการตรวจสอบ',
    btn: 'ยืนยัน'
  },
  sound: {
    entry: 'ปลายแหลม',
    title: 'เสียงแจ้งแทน',
    current: 'หมายเหตุปัจจุบัน:',
    placeholder: 'โปรดเลือกเสียง',
    audios: [
      "เสียงเริ่มต้น",
      "เสียง1",
      "เสียง2",
      "เสียง3",
      "เสียง4",
      "เสียง5",
      "เสียง6"
    ]
  },
  "googleCheck": {
    "isgoogle": "กูเกิลทุติยภูมิ",
    "title": "ตรวจสอบกูเกิล",
    "btns": ["ก้าวไปข้างหน้า", "ขั้นตอนต่อไป", "เปิดผนึก", "ทำสำเนา"],
    "step1": {
      "tips": "กรุณาสแกนรหัส 2D และติดตั้ง Google authenticators ถ้าคุณได้ติดตั้งแล้วโปรดไปที่ขั้นตอนต่อไป",
      "action": "ดาวน์โหลดหลักฐาน",
      "desc": "ฉันได้ติดตั้ง Google ค้นหา"
    },
    "step2": {
      "tips": "ใช้ Google Authenticators สแกนรหัสสองมิติด้านล่างและคุณจะได้รับรหัสการตรวจสอบคู่ของตัวเลขหกหลักที่มีการเปลี่ยนแปลงทุก 30 วินาที",
      "action": "สแกนรหัส 2D",
      "desc1": "ถ้ารหัสล้มเหลวโปรดป้อนคีย์ข้างต้นเพื่อตรวจสอบคุณต้องตั้งค่าบัญชีผู้ใช้ xxx@DigFinex xxx กรอกข้อมูลในบัญชีอีเมลของคุณหรือชื่อเล่นของคุณ",
      "desc2": "ฉันมีหกบิตรหัสการตรวจสอบคู่"
    },
    "step3": {
      "label": "รหัสการตรวจสอบคู่",
      "placeholder": "กรุณาใส่รหัสการตรวจสอบคู่"
    }
  },
}
